//-----------------------------------------------------------------------------------------------------------------------------سوال اول
//console.log(Number("234a")); // نمی تواند به نامبر تبدیل کند
//------2
//console.log('1' + 2 + 2); //جواب استرینگ  بر می گرداند
//------3
//let apples = "2";
//let orange = "3";
//console.log( +apples + +orange );// چون قبل از متغییر ها مثبت گذاشته شده است آن را تبدیل به نامبر می کند و با هم جمع می شوند.
//------4
//let counter = 1;
//console.log ( 2 * ++counter);// چون به کانت 1 عدد اضافه کرده میشه 2 . و 2*2 میشه 4. جواب چهار را بر می گرداند
//------5
//console.log(undefined == null);//true
//console.log(undefined === null);//false
///console.log( null == "\n0\n")//false
//console.log( null == +"\n0\n")//false
// اندیفایند برابر با نان می باشد و نال برابر صفر می باشد.
//پس اگر از == استفاده کنیم ترور برمیگراند چون یه سریع مشترکات دارد.
//ولی اگر === باشد چون دقیق تر عمل می کند و باید عینا شبیه هم باشند فالس را بر می گردانذ 

//  چون undefined مقدارش برابر با nan هس و null برابر 0 است
//  پس اگر == بزاریم تطبق یه اشتراکاتی که دارن true بر می گرداند . ولی اگر === بزاریم چون همه جوانب را می سنجد و دقیق تر عمل می کند جواب false می شود

//--------------------------------------------------------------------------------------------------------------------------------سوال  دو 
//let num1   = Number( prompt('عدد اول را وارد کنید   ' , 20))  
//let num2   = Number( prompt('عدد دوم را وارد کنید :   ' , 20)) 
//let num3   = Number( prompt('عدد سوم را وارد کنید : ' , 20)) 
//if(num1 == num2 & num2 == num3) {
     // console.log('yes')
    //} else  {
   // console.log('no')
  //}

//-----------------------------------------------------------------------------------------------------------------------------------سوال سه  
// let num =  Number((prompt ('یه عددی رو وارد کن ')))
// let tedad = num1.toString().length; 
// console.log( tedad )
//-----------------------------------------------------------------------------------------------------------------------------------سوال چهار

// let num1 = 12 //Number(prompt('عدد مورد نظر را وارد کن : ' , 0 ))
// let num2 =  30 //Number(prompt('عدد مورد نظر را وارد کن : ' , 0 ))
// //let minmum = (num1 > num2) ?  minmum = num2 :  minmum = num1;
// for(let i= 1; i <= num1 || num2;  i++){
//   if(num1 % i ==0 && num2 % i == 0){ 
//     console.log(i)
  
//   }
  
// }

